Revit 2024 API
IFCFileReadOptions Members
The IFCFileReadOptions type exposes the following members.
Constructors
Name | Description
IFCFileReadOptions
 Creates a default IFCFileReadOptions.
Methods
Name | Description
Dispose
Releases all resources used by the IFCFileReadOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
FileName
 The full file name of the IFC file to be read.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
XMLConfigFileName
 The XML configuration file name. It is used only for reading IFC-XML format file.
See Also
IFCFileReadOptions Class
Autodesk.Revit.DB.IFC Namespace